import streamlit as st
import numpy as np
import cv2
import joblib
import tensorflow as tf
import pandas as pd


# =====================================
# CONFIG
# =====================================

st.set_page_config(

    page_title="AI Web App",

    page_icon="🤖",

    layout="wide"

)


# =====================================
# LOAD MODELS
# =====================================

flower_nn = tf.keras.models.load_model("flower_nn.keras")

flower_label = joblib.load("label.pkl")

house_model = joblib.load("ensemble_model.pkl")

columns = joblib.load("columns.pkl")

class_names = flower_label.classes_


# accuracy (ใส่ค่าจริงของคุณ)

FLOWER_ACC = 0.80
HOUSE_R2 = 0.91


# =====================================
# SIDEBAR
# =====================================

st.sidebar.title("Web AI Projects")

menu = st.sidebar.radio(

"Menu",

(

"Neural Network Info",

"Ensemble Info",

"Test Flower Model",

"Test House Model"

)

)


# =====================================
# PAGE 1
# =====================================

if menu == "Neural Network Info":

    st.title("Flower Classification using Neural Network")


    col1, col2 = st.columns(2)


    with col1:

        st.header("Neural Network คืออะไร?")

    st.write("""

คือ โมเดลปัญญาประดิษฐ์ที่เลียนแบบการทำงานของสมองมนุษย์ โดยใช้โครงสร้างที่ประกอบด้วย Input Layer, Hidden Layer และ Output Layer เพื่อเรียนรู้จากข้อมูลและนำไปใช้ในการทำนายหรือจำแนกข้อมูล

""")


    with col2:

        st.metric("Accuracy", f"{FLOWER_ACC*100:.2f}%")


    st.header("บทนำ (Introduction)")

    st.write("""

โครงงานนี้พัฒนาโมเดล Neural Network สำหรับจำแนกประเภทดอกไม้ (Flower Classification) โดยใช้เทคนิค Deep Learning เพื่อให้คอมพิวเตอร์สามารถจำแนกชนิดของดอกไม้จากรูปภาพได้อัตโนมัติ

โมเดลที่ใช้คือ MobileNetV2 ซึ่งเป็น Convolutional Neural Network (CNN) ที่มีประสิทธิภาพสูงและเหมาะสำหรับงานด้านการจำแนกภาพประเภทดอกไม้ที่ใช้ในการจำแนกมีทั้งหมด 5 ประเภท ได้แก่: Daisy , Dandelion , Rose , Sunflower , Tulip

""")


    st.header("การเตรียมข้อมูล (Data Preparation)")

    st.write("""

ข้อมูลที่ใช้มาจาก Flower Dataset บน Kaggle ซึ่งเป็นชุดข้อมูลรูปภาพดอกไม้ขั้นตอนการเตรียมข้อมูลมีดังนี้:

2.1 การปรับขนาดรูปภาพ (Resizing) รูปภาพทั้งหมดถูกปรับขนาดเป็น 224 × 224 pixels เพื่อให้เหมาะสมกับโมเดล MobileNetV2

2.2 การ Normalize ข้อมูล ทำการปรับค่า pixel ให้อยู่ในช่วง: -1 ถึง 1 เพื่อช่วยให้โมเดลเรียนรู้ได้ดีขึ้น

2.3 การเพิ่มข้อมูล (Data Augmentation) ใช้เทคนิค: Random Flip Random Rotation Random Zoom เพื่อ: ลด Overfitting เพิ่มความหลากหลายของข้อมูล

""")




    st.header("ทฤษฎีของอัลกอริทึม (Algorithm Theory)")

    st.write("""

โมเดลที่ใช้คือ: MobileNetV2 MobileNetV2 เป็น Convolutional Neural Network (CNN) CNN ทำงานโดย:

3.1 Convolution Layer ใช้สำหรับ: ตรวจจับ Feature ของภาพ เช่น: ขอบ สี รูปร่าง

3.2 Pooling Layer ใช้สำหรับ: ลดขนาดข้อมูล ลดการคำนวณ

3.3 Fully Connected Layer ใช้สำหรับ: จำแนกประเภทภาพ

3.4 Softmax Layer ใช้สำหรับ: แสดงผลลัพธ์เป็นความน่าจะเป็นเช่น: Rose: 92% Daisy: 5% Tulip: 3%

""")
    
    st.header("ขั้นตอนการพัฒนาโมเดล (Model Development Process)")
    st.write("""
             
ขั้นตอน 1: Load Dataset โหลดข้อมูลภาพจากโฟลเดอร์
flowers/train
flowers/validation
flowers/test
             
ขั้นตอน 2: Preprocess Data
Resize
Normalize
Augmentation
 
ขั้นตอน 3: Load MobileNetV2 ใช้:
Transfer Learning โดยใช้ weight จาก ImageNet

ขั้นตอน 4: Train Model
ทำการ train โมเดลด้วย: Training data Validation data

ขั้นตอน 5: Fine Tuning
ปรับปรุงโมเดลเพื่อเพิ่มความแม่นยำ
             
ขั้นยตอน 6: Save Model
บันทึกเป็นไฟล์: flower_nn.keras เพื่อนำไปใช้งานใน Web Application

""")
    
    st.header("ผลลัพธ์ของโมเดล (Model Performance)")
    st.write("""
ผลลัพธ์ของโมเดล (Model Performance) ผลลัพธ์:
Metric	Value
Accuracy	80% – 95%
Loss	ต่ำ
โมเดลสามารถจำแนกดอกไม้ได้อย่างแม่นยำ
""")
    
    st.header("การนำไปใช้งาน (Deployment)")
    st.write("""
โมเดลถูกนำไปใช้ใน Web Application โดยใช้ Streamlit
ผู้ใช้สามารถ: Upload รูปภาพ ระบบจะแสดงผลการจำแนก
""")
    
    st.header("สแหล่งอ้างอิง (References)")
    st.write("""
1. Kaggle Flower Dataset https://www.kaggle.com/datasets/alxmamaev/flowers-recognition
2. TensorFlow Documentation:https://www.tensorflow.org
3. MobileNetV2 Paper: https://arxiv.org/abs/1801.04381
4. ChatGPT: https://chat.openai.com
""")
    st.header("สรุป (Conclusion)")
    st.write("""

โมเดล Neural Network ที่พัฒนาขึ้นสามารถจำแนกประเภทดอกไม้ได้อย่างมีประสิทธิภาพ โดยใช้เทคนิค Deep Learning และ Transfer Learning โมเดลสามารถนำไปใช้งานจริงผ่าน Web Application ได้
""")

# =====================================
# PAGE 2
# =====================================

elif menu == "Ensemble Info":

    st.title("House Price Prediction using Ensemble")


    col1, col2 = st.columns(2)


    with col1:

        st.header("Neural Network คืออะไร?")

    st.write("""

คือ เทคนิคที่ใช้หลายโมเดล Machine Learning ทำงานร่วมกันโดยนำผลลัพธ์ของแต่ละโมเดลมารวมกันเพื่อเพิ่มความแม่นยำและลดข้อผิดพลาด เช่น การใช้ Random Forest และ Gradient Boosting ร่วมกันเพื่อทำนายราคาบ้าน

""")


    with col2:

        st.metric("R2 Score", f"{HOUSE_R2:.2f}")
    
    st.header("บทนำ (Introduction)")
    st.write("""
โครงงานนี้พัฒนาโมเดล Machine Learning Ensemble สำหรับทำนายราคาบ้าน (House Price Prediction) โดยใช้เทคนิค Ensemble Learning เพื่อเพิ่มความแม่นยำในการพยากรณ์ราคาอสังหาริมทรัพย์จากคุณสมบัติต่าง ๆ ของบ้าน

Ensemble Learning เป็นเทคนิคที่รวมผลลัพธ์จากหลายโมเดล เพื่อให้ได้ผลลัพธ์ที่แม่นยำและมีความเสถียรมากกว่าโมเดลเดี่ยว           
""")


    st.header("การเตรียมข้อมูล (Data Preparation)")

    st.write("""

ข้อมูลที่ใช้มาจาก House Prices Dataset จาก Kaggle ซึ่งประกอบด้วยข้อมูลคุณลักษณะของบ้าน เช่น:
             
- Overall Quality (คุณภาพบ้าน)
- Living Area (พื้นที่ใช้สอย)
- Number of Rooms (จำนวนห้อง)
- Year Built (ปีที่สร้าง)

2.1 การจัดการ Missing Values ทำการแทนค่าข้อมูลที่หายไป (Missing Values) ด้วย: 0 หรือค่าเฉลี่ยเพื่อให้ข้อมูลสมบูรณ์

2.2 การแปลงข้อมูลประเภทข้อความ (Encoding) แปลงข้อมูลประเภทข้อความ เช่น : Neighborhood ให้เป็นตัวเลขโดยใช้ : One-Hot Encoding เพื่อให้โมเดลสามารถประมวลผลได้

2.3 การเลือก Feature (Feature Selection) เลือกเฉพาะ Feature ที่สำคัญ เช่น : OverallQual GrLivArea เพื่อลดความซับซ้อนของโมเดล

""")




    st.header("ทฤษฎีของอัลกอริทึม (Algorithm Theory)")

    st.write("""

โมเดลที่ใช้คือ:

Ensemble Learning

Ensemble Learning คือการรวมหลายโมเดล Machine Learning เข้าด้วยกัน

เพื่อเพิ่ม:

Accuracy

Stability

3.1 Random Forest Random Forest เป็นอัลกอริทึมที่ใช้: Decision Tree หลายต้น แล้วนำผลลัพธ์มาเฉลี่ย

ข้อดี:แม่นยำสูงลด Overfitting

3.2 Gradient Boosting Gradient Boosting เป็นอัลกอริทึมที่:เรียนรู้จากข้อผิดพลาดของโมเดลก่อนหน้าเพื่อปรับปรุงผลลัพธ์

ข้อดี: แม่นยำมากใช้กันอย่างแพร่หลาย

3.3 Voting Ensemble Voting เป็นเทคนิคที่ : รวมผลลัพธ์จากหลายโมเดลแล้วเลือกผลลัพธ์สุดท้ายช่วยเพิ่มความแม่นยำ

""")
    
    st.header("ขั้นตอนการพัฒนาโมเดล (Model Development Process)")
    st.write("""
             
ขั้นตอน 1 : Load Dataset โหลดข้อมูลจากไฟล์ : train.csv
             
ขั้นตอน 2: Data Preprocessing Fill Missing Values Encoding Feature Selection

ขั้นตอน 3: Train Model ทำการ Train โมเดล : Random Forest Gradient Boosting

ขั้นตอน 4: Ensemble Model รวมโมเดลโดยใช้: Voting Ensemble
             
ขั้นตอน 5: Save Model บันทึกเป็นไฟล์: ensemble_model.pkl เพื่อนำไปใช้งานใน Web Application

""")
    
    st.header("ผลลัพธ์ของโมเดล (Model Performance)")
    st.write("""
ผลลัพธ์:

Metric      Value
R² Score	0.90
RMSE	    ต่ำ
Accuracy	สูง
             
ค่า R² Score = 0.90
หมายความว่า : โมเดลสามารถทำนายราคาได้แม่นยำ 90%
""")
    
    st.header("การนำไปใช้งาน (Deployment)")
    st.write("""
โมเดลถูกนำไปใช้ใน Web Application
ผู้ใช้สามารถ:
- ใส่ข้อมูลบ้าน
- ระบบจะแสดงราคาที่คาดการณ์
""")
    
    st.header("สแหล่งอ้างอิง (References)")
    st.write("""
1. House Prices Dataset https://www.kaggle.com/competitions/house-prices-advanced-regression-techniques

2. Scikit-Learn Documentation:https://scikit-learn.org

3. Ensemble Learning:https://en.wikipedia.org/wiki/Ensemble_learning

4. ChatGPT: https://chat.openai.com
""")
    st.header("สรุป (Conclusion)")
    st.write("""

โมเดล Ensemble สามารถทำนายราคาบ้านได้อย่างแม่นยำ โดยใช้เทคนิค Machine Learning หลายโมเดลร่วมกัน โมเดลสามารถนำไปใช้งานจริงผ่าน Web Application
""")


# =====================================
# PAGE 3
# =====================================

elif menu == "Test Flower Model":

    st.title("Test Flower Classification")


    file = st.file_uploader("Upload Image")


    if file:


        img = cv2.imdecode(

        np.frombuffer(file.read(), np.uint8),

        1

        )


        st.image(img, width=300)


        img = cv2.resize(img,(224,224))

        img = tf.keras.applications.mobilenet_v2.preprocess_input(img)

        img = np.expand_dims(img,0)


        pred = flower_nn.predict(img)

        index = np.argmax(pred)

        confidence = np.max(pred)


        st.success(

        f"Prediction: {class_names[index]}"

        )


        st.info(

        f"Confidence: {confidence*100:.2f}%"

        )


# =====================================
# PAGE 4
# =====================================

elif menu == "Test House Model":

    st.title("House Price Prediction")


    overall = st.slider(

    "Overall Quality",

    1,10,5

    )


    area = st.number_input(

    "Living Area",

    500,5000,1500

    )


    if st.button("Predict"):


        data = pd.DataFrame({

        "OverallQual":[overall],

        "GrLivArea":[area]

        })


        data = data.reindex(

        columns=columns,

        fill_value=0

        )


        price = house_model.predict(data)


        st.success(

        f"Predicted Price: ${price[0]:,.0f}"

        )

st.markdown("""---""")

st.markdown(
"""
<div style='text-align: center; padding: 10px;'>

<b>AI Web Application Project  </b><br>

Developed by: ณัฐพงศ์ เกตุรัตน์<br>

Student ID: 6704062611336

Course : INTELLIGENT SYSTEM (IS)

Github: 

</div>
""",
unsafe_allow_html=True
)

